return { modifier="alt", chords={
-- ╭—————╮__7.ALT_______╭—————┬————————┬—————┬—————┬—————┬—————┬—————┬—————┬—————┬—————┬——————╮
-- │  `  │      │       │     │    €   │  ‰  │  ↑  │     │  ∞  │  ←  │  →  │  —  │  ≠  │     │
-- ├—————┴—┬————┴—┬—————┴—┬———┴—┬——————┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬————┤
-- │  ⇥    │Music │Window^│ AI  │WebStorm│  ™  │  ѣ  │  ѵ  │  і  │  ѳ  │  ′  │Zoom │     │  ℝ │
-- ├———————┴┬—————┴┬——————┴┬————┴┬———————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴╮   │
-- │        │   ≈  │       │  °  │    £   │     │  ₽  │  „  │  “  │  ”  │  ‘  │  ’  │  |  │   │
-- ├————————┴┬—————┴┬——————┴┬————┴┬———————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴—————┴———┤
-- │         │  📝  │  ×    │  ©  │  ↓     │  ß  │     │  −  │  «  │  »  │  …  │              │
-- ├————————┬┴—————┬┴———————┼—————┴————————┴—————┴—————┴—————┼—————┴┬————┴┬————┴——————————————╯
-- │        │🟢🟢🟢 │        │    NON-BREAKABLE SPACE         │      │     │
-- ╰————————┴——————┴————————┴————————————————————————————————┴——————┴—————╯
-- ⌫:  — remove word to the left
-- ⇥: switch the app windows with AltTab app
-- ↩: ℝ — show intention actions and quick-fixes popup
--    🌐 — open address in new tab
-- \: Copilot Suggestion
-- z: 📝 — toggle wordwrap
-- ␣: Music — Start Genious Shuffle
{ key="[", app="zoom.us" },
{ key="q", app="Music"},
{ key="w", specific_function="window.fullscreen"},
{ key="e", app="Claude"},
{ key="r", app="WebStorm"},
{ key="a", specific_function="window.left"},
{ key="s", specific_function="window.set_all_to_default" },
{ key="d", specific_function="window.right" },
{ key="f", specific_function="translate_to_russian"},
{ key="g", specific_function="browser_git"},
{ key="z", app="n8n" },
{ key="x", app="XCode" },
-- c: itsycal Calendar (custom in app)
{ key="v", specific_function="browser_youtube" },
-- double alt: Claude start dialog with screenshot
}}
