return { modifier={"left_command", "left_control"}, chords={
-- ╭—————╮__18.CMD_CONTROL_______╭—————┬—————┬—————┬—————┬—————┬—————┬—————┬—————┬—————╮
-- │     │     │     │     │     │     │     │     │     │     │     │     │     │     │
-- ├—————┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┤
-- │       │    │     │  ℝ  │  ℝ  │     │     │Music│     │     │     │     │     │   │
-- ├———————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴╮  │
-- │        │  ℝ  │    │    │    │  ℝ  │     │     │     │     │     │     │     │  │
-- ├————————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴—————┴——┤
-- │         │ iOS │  ℝ  │  ℝ  │     │     │     │     │     │     │     │             │
-- ├————————┬┴————┬┴—————┼—————┴—————┴—————┴—————┴—————┼—————┴┬————┴┬————┴—————————————╯
-- │ 🟢🟢🟢  │     │🟢🟢🟢 │                            │      │     │
-- ╰————————┴—————┴——————┴—————————————————————————————┴——————┴—————╯
-- q: logout
-- e: ℝ — show list of tabs of current panel
-- r: ℝ — rerun tests
-- u: Music — show/hide lyrics panel
-- a: ℝ — show all affected files in source control
--    Mail — archive message
-- s: 📁 — toggle SideBar
--    ℝ — toggle Sidebar
-- d:  — look up the selected word
-- f:  — toggle fullscreen of current app
-- g: ℝ — select all occurances
{ key="z", app="Simulator" }
-- x: ℝ — scroll to Top
-- c: ℝ — scroll to Bottom
-- ␣:  — emogies
}
}
