return { modifier={"left_command", "left_control"}, chords={
-- ╭—————╮__18.CMD_CONTROL_______╭—————┬—————┬—————┬—————┬—————┬—————┬—————┬—————┬—————╮
-- │     │     │     │     │     │     │     │     │     │     │     │     │     │     │
-- ├—————┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┤
-- │       │    │     │  ℝ  │  ℝ  │     │     │     │     │     │     │     │     │   │
-- ├———————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴╮  │
-- │        │  ℝ  │    │    │    │     │     │     │     │     │     │     │     │  │
-- ├————————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴—————┴——┤
-- │         │     │  ℝ  │  ℝ  │     │     │     │     │     │     │     │             │
-- ├————————┬┴————┬┴—————┼—————┴—————┴—————┴—————┴—————┼—————┴┬————┴┬————┴—————————————╯
-- │ 🟢🟢🟢  │     │🟢🟢🟢 │                            │            │
-- ╰————————┴—————┴——————┴—————————————————————————————┴——————┴—————╯
-- q: logout
-- e: ℝ — show list of tabs of current panel
-- r: ℝ — rerun tests
-- a: ℝ — show all affected files
--    Mail — archive message
-- f:  — toggle fullscreen of current app
-- g: ℝ — select all occurances
-- s: 📁 — Toggle SideBar
--    ℝ — Toggle Sidebar
-- d:  — look up the selected word
-- x: ℝ — scroll to Top
-- c: ℝ — scroll to Bottom
-- ␣:  — emogies
}
}
