return { modifier= {"left_control", "left_shift"}, chords={
-- ╭—————╮__19.CTRL_SHIFT__╭—————┬—————┬—————┬—————┬—————┬—————┬—————┬—————┬—————┬—————╮
-- │ 📊  │  ℝ  │  ℝ  │  ℝ  │     │     │     │     │     │     │     │     │     │     │
-- ├—————┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┴—┬———┤
-- │      │    │  ⌫  │  ⌦  │  ℝ  │     │     │     │     │     │    │     │     │   │
-- ├———————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴╮  │
-- │        │    │     │  ℝ  │     │  ℝ🔄│     │     │     │     │     │     │     │  │
-- ├————————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴┬————┴—————┴——┤
-- │ 🟢🟢🟢   │     │     │     │     │     │     │     │     │     │     │             │
-- ├————————┬┴————┬┴—————┼—————┴—————┴—————┴—————┴—————┼—————┴┬————┴┬————┴—————————————╯
-- │ 🟢🟢🟢  │     │      │                             │      │     │
-- ╰————————┴—————┴——————┴—————————————————————————————┴——————┴—————╯
{ key="escape", app="Activity Monitor" }, -- Like on Windows 📊
-- 1: ℝ — toggle bookmark 1
-- 2: ℝ — toggle bookmark 2
-- 3: ℝ — toggle bookmark 3
-- ⇥:  — go to previous tab
-- q:  — log out with dialogs
-- w: ⌫ (backspace)
-- e: ⌦ (delete)
-- r: ℝ — run Unit Tests
-- ????? p:  — open private window
-- a:  — select line to the left
-- s: ⌫ (backspace) — LEFT HAND DELETE (karabiner)
-- d: ⌦ (forward delete) — LEFT HAND DELETE (karabiner)
-- g: ℝ🔄 — current file git history
-- h: ℝ — hierarchy
}
}
