return {
--    ╭—————╮
--    │  ⌃  │    control
--    ╰—————╯
--
--         karabiner: no
--
--——————— chord ┬ en | ru | el ┬
--      ⌃       │      ⌃       │
--      ⌃click  │              │  — right button click
--              │              │ 📁 — open new new tab
--      ⌃scroll │              │  — zoom screen with Apple Accessibility
--——————————————┼——————————————┼——————————————————————————————————
--          ⌃⌃  │              │ 📝 — select task to run
--              │              │ ℝ — select configuration to run
--              ┴              ┴
}
