return {
--    ╭—————╮
--    │  F  │    finder / full screen
--    ╰—————╯
--
--         karabiner: no
--
--————————— chord ┬ en | ru | el ┬ ┬
--            f   │ f    а    φ  │e│ 🌐 Go Full Screen Video
--————————————————┼——————————————┼—┼——————————————————————————————————
{ chord =   "⇪f",                    app = "Finder" },
--           ⇧f   │ F    А    Φ  │⋅│
--           ⌃f   │              │⋅│ ℝ — focus Find panel
--                │              │⋅│ 📝 — move cursor right
--           ⌥f   │ f    £    ≠  │⋅│ Fork — toggle Force Push on Push dialog
--           ⌘f   │              │⋅│  — find
--           ⇥f   │              │ │ ???
--————————————————┼——————————————┼—┼——————————————————————————————————
--    ⇪⇧f → F15   │              │ │ ↓
{ chord =  "F15",                    app = "Marta" },
--          ⇪⌃f   │              │ │ ???
--          ⇪⌥f   │              │ │ ???
--          ⇪⌘f   │      ⌘o      │k│  — open file
--          ⇧⌃f   │              │ │ ???
--          ⇧⌥f   │              │⋅│ 📝 — format
--          ⇧⌘f   │              │⋅│ Music — open/close Full Screen Player
--                │              │⋅│ Fork — quick Fetch
--                │              │⋅│ Fork — toggle Force Push on Push dialog
--                │              │⋅│ Mail — forward email
--                │              │⋅│ ℝ — search in files
{ chord =  "⌃⌥f",                    fn = "translate_to_russian" },
--          ⌃⌘f   │              │⋅│ toggle fullscreen of current app
--          ⌥⌘f   │              │⋅│ ℝ, 📝 — extract field
--————————————————┼——————————————┼—┼——————————————————————————————————
--         ⇪⇧⌃f   │              │ │
--         ⇪⇧⌥f   │              │ │
--         ⇪⇧⌘f   │              │ │
--         ⇪⌃⌥f   │              │ │
--         ⇪⌃⌘f   │              │ │
--         ⇪⌥⌘f   │              │ │
--         ⇧⌃⌥f   │              │ │
--         ⇧⌃⌘f   │              │ │
--         ⇧⌥⌘f   │              │ │
--         ⌃⌥⌘f   │              │ │
--                ┴              ┴ ┴
}
