return {
--    ╭—————╮
--    │  G  │    git / go to
--    ╰—————╯
--
--         karabiner: no
--
--———————— chord ┬ en | ru | el ┬
--           g   │ g    п    γ  │
--———————————————┼——————————————┼——————————————————————————————————
{ chord =  "⇪g",                  app = "Fork" },
--          ⇧g   │ G    П    Γ  │
--          ⌃g   │              │ ℝ🔄 — focus Git panel
{ chord =  "⌥g",                  fn = "browser_git" },
--          ⌘g   │              │ ℝ🔄 — git operations popup (custom)
--———————————————┼——————————————┼——————————————————————————————————
--         ⇪⇧g   │              │
--         ⇪⌃g   │              │
--         ⇪⌥g   │              │
--         ⇪⌘g   │              │
--         ⇧⌃g   │              │ ℝ🔄 — current file git history
--         ⇧⌥g   │              │
--         ⇧⌘g   │              │ 📁 — go to GoTo dialog
--         ⌃⌥g   │              │ browser_git
{ chord = "⌃⌥g",                  fn = "browser_git" },
--         ⌃⌘g   │              │ ℝ — select all occurances
--         ⌥⌘g   │              │
--———————————————┼——————————————┼——————————————————————————————————
--        ⇪⇧⌃g   │              │
--        ⇪⇧⌥g   │              │
--        ⇪⇧⌘g   │              │
--        ⇪⌃⌥g   │              │
--        ⇪⌃⌘g   │              │
--        ⇪⌥⌘g   │              │
--        ⇧⌃⌥g   │              │
--        ⇧⌃⌘g   │              │
--        ⇧⌥⌘g   │              │
--        ⌃⌥⌘g   │              │
--               ┴              ┴
}
