return {
--    ╭—————╮
--    │  R  │    replace / refresh / IDE
--    ╰—————╯
--
--         karabiner: no
--
--————————— chord ┬ en | ru | el ┬
--            r   │ r    к    ρ  │
--————————————————┼——————————————┼——————————————————————————————————
{ chord =   "⇪r",                  app = "Rider" },
--           ⇧r   │ R    К    Ρ  │
--           ⌃r   │              │ ℝ — run
{ chord =   "⌥r",                  app = "WebStorm" },
--           ⌘r   │              │ ℝ, 📝 — replace in current file
--                │              │ Mail — reply to email
--————————————————┼——————————————┼——————————————————————————————————
--          ⇪⇧r   │              │
{ chord =  "F17",                 app = "Android Studio" },
--          ⇪⌃r   │              │
--          ⇪⌥r   │              │
--          ⇪⌘r   │              │
--          ⇧⌃r   │              │ ℝ — run Unit Tests
--          ⇧⌥r   │ ˚    ˚    Δ  │
--      ⇧⌥r ⇧⌥r   │ s̊    ы̊    no │ double to add sign to previous symbol
--          ⇧⌘r   │              │ Mail — reply all to email
--                │              │ ℝ — replace in files
--                │              │ Yandex — clear cache and reload page
{ chord =  "⌃⌥r",                  app = "WebStorm" },
--          ⌃⌘r   │              │ ℝ — rerun tests
--          ⌥⌘r   │              │ ℝ, 📝 — resume running (debugging)
--                │              │ Mail — show Reply-To field
--————————————————┼——————————————┼——————————————————————————————————
--         ⇪⇧⌃r   │              │
--         ⇪⇧⌥r   │              │
--         ⇪⇧⌘r   │              │
--         ⇪⌃⌥r   │              │
--         ⇪⌃⌘r   │              │
--         ⇪⌥⌘r   │              │
--         ⇧⌃⌥r   │              │
--         ⇧⌃⌘r   │              │
--         ⇧⌥⌘r   │              │
--         ⌃⌥⌘r   │              │
--                ┴              ┴
}
