return {
--    ╭—————╮
--    │  R  │    replace / refresh / IDE
--    ╰—————╯
--
--         karabiner: ⇪r → F17
--
--————————— chord ┬ en | ru | el ┬ ┬
--            r   │ r    к    ρ  │⋅│
--————————————————┼——————————————┼—┼——————————————————————————————————
--           ⇪r   │     F17      │k│ ↓
{ chord =  "F17",                    app = "Rider" },
--           ⇧r   │ R    К    Ρ  │⋅│
--           ⌃r   │              │⋅│ ℝ — run
{ chord =   "⌥r",                    app = "WebStorm" },
--           ⌘r   │              │⋅│ ℝ, 📝 — replace in current file
--                │              │⋅│ Mail — reply to email
--————————————————┼——————————————┼—┼——————————————————————————————————
--          ⇪⇧r   │     ⇧F17     │k│ ↓
{ chord = "⇧F17",                    app = "Android Studio" },
--          ⇪⌃r   │     ⌃F17     │k│ ???
--          ⇪⌥r   │     ⌥F17     │k│ ???
--          ⇪⌘r   │     ⌘F17     │k│ ???
--          ⇧⌃r   │              │⋅│ ℝ — run Unit Tests
--          ⇧⌥r   │ ˚    ˚    Δ  │⋅│ ???
--      ⇧⌥r ⇧⌥r   │ s̊    ы̊    no │⋅│ double to add sign to previous symbol
--          ⇧⌘r   │              │⋅│ Mail — reply all to email
--                │              │⋅│ ℝ — replace in files
--                │              │⋅│ Yandex — clear cache and reload page
{ chord =  "⌃⌥r",                    app = "WebStorm" },
--          ⌃⌘r   │              │⋅│ ℝ — rerun tests
--          ⌥⌘r   │              │⋅│ ℝ, 📝 — resume running (debugging)
--                │              │⋅│ Mail — show Reply-To field
--————————————————┼——————————————┼—┼——————————————————————————————————
--         ⇪⇧⌃r   │              │ │
--         ⇪⇧⌥r   │              │ │
--         ⇪⇧⌘r   │              │ │
--         ⇪⌃⌥r   │              │ │
--         ⇪⌃⌘r   │              │ │
--         ⇪⌥⌘r   │              │ │
--         ⇧⌃⌥r   │              │ │
--         ⇧⌃⌘r   │              │ │
--         ⇧⌥⌘r   │              │ │
--         ⌃⌥⌘r   │              │ │
--                ┴              ┴ ┴
}
