return {
--    ╭————————╮
--    │  ⇧     │    shift
--    ╰————————╯
--
--         karabiner: no
--
--——————— chord ┬ en | ru | el ┬
--      ⇧       │      ⇧       │
--——————————————┼——————————————┼——————————————————————————————————
--     ⇧⇧       │              │ ℝ — open search
--              │              │ 📝 — open search
--      ⇧click  │              │ Safari — Add to Reading List
--      ⇧↩      │              │  — insert new line
--              │              │ 📝 — insert line below
--              ┴              ┴
}
