return {
--    ╭—————╮
--    │  Y  │    video
--    ╰—————╯
--
--         karabiner: no
--
--———————— chord ┬ en | ru | el ┬
--           y   │ y    н    υ  │
--———————————————┼——————————————┼——————————————————————————————————
{ chord =  "⇪y",                  app = "Iina", window_default_position = "bottom" },
--          ⇪y   │              │ IINA (bottom window)
--          ⇧y   │ Y    Н    Υ  │
--          ⌃y   │              │ Unix Terminal — paste what was cut in terminal
--          ⌥y   │ ѣ    ѣ    ¥  │
--          ⌘y   │              │ 🌐 — show all history
--———————————————┼——————————————┼——————————————————————————————————
--         ⇪⇧y   │              │
--         ⇪⌃y   │              │
--         ⇪⌥y   │              │
--         ⇪⌘y   │              │
--         ⇧⌃y   │              │
--         ⇧⌥y   │ Ѣ    Ѣ    no │
--         ⇧⌘y   │              │
{ chord = "⌃⌥y",                  fn = "youtube_stream" },
--         ⌥⌘y   │              │
--———————————————┼——————————————┼——————————————————————————————————
--        ⇪⇧⌃y   │              │
--        ⇪⇧⌥y   │              │
--        ⇪⇧⌘y   │              │
--        ⇪⌃⌥y   │              │
--        ⇪⌃⌘y   │              │
--        ⇪⌥⌘y   │              │
--        ⇧⌃⌥y   │              │
--        ⇧⌃⌘y   │              │
--        ⇧⌥⌘y   │              │
--        ⌃⌥⌘y   │              │
--               ┴              ┴
}
