return {
--    ╭—————╮
--    │  Z  │    undo / suspend
--    ╰—————╯
--
--         karabiner: ⇪⇧⌃z → rewind
--                    ⇪z → F20
--
--———————— chord ┬ en | ru | el ┬ ┬
--           z   │ z    я    ζ  │ │ 🌐 Vim Mark Links
--———————————————┼——————————————┼—┼——————————————————————————————————
--          ⇪z   │     F20      │k│
{ chord = "F20",                    fn = "android.show_all" },
--          ⇧z   │ Z    Я    Ζ  │ │ IINA — add sub-delay -0.5s
--          ⌃z   │              │ │ Unix Terminal — suspend (background)
--          ⌥z   │              │ │ 📝 — toggle wordwrap
--               │              │ │ Warp — type "/new" (Claude Code shortcut)
--          ⌘z   │              │ │  — undo
--          ⇥z   │      ⌘/      │ │ ℝ — comment line
--               │              │ │ 📝 — toggle comment line
--               │              │ │ Music — show or hide the status bar
--———————————————┼——————————————┼—┼——————————————————————————————————
--         ⇪⇧z   │     ⇧F20     │k│ ???
--         ⇪⌃z   │     ⌃F20     │k│ ???
--         ⇪⌥z   │     ⌥F20     │k│ ???
--         ⇪⌘z   │     ⌘F20     │k│ ???
--         ⇧⌃z   │              │ │ ???
{ chord = "⇧⌥z",                    app = "Simulator" },
--         ⇧⌘z   │              │ │  — redo
--               │              │ │ Mail — unsend email
{ chord = "⌃⌥z",                    app = "n8n" },
{ chord = "⌃⌘z",                    app = "Simulator" },
--         ⌥⌘z   │              │ │ 📝 — revert selected in git
--———————————————┼——————————————┼—┼——————————————————————————————————
--        ⇪⇧⌃z   │    rewind    │k│  → rewind
--        ⇪⇧⌥z   │              │ │
--        ⇪⇧⌘z   │              │ │
--        ⇪⌃⌥z   │              │ │
--        ⇪⌃⌘z   │              │ │
--        ⇪⌥⌘z   │              │ │
--        ⇧⌃⌥z   │              │ │
--        ⇧⌃⌘z   │              │ │
--        ⇧⌥⌘z   │              │ │
--        ⌃⌥⌘z   │              │ │
--               ┴              ┴ ┴
}
