return {
--    ╭—————╮
--    │  Z  │    undo / suspend
--    ╰—————╯
--
--         karabiner: ⇪⇧⌃z → rewind
--
--———————— chord ┬ en | ru | el ┬
--           z   │ z    я    ζ  │ 🌐 Vim Mark Links
--———————————————┼——————————————┼——————————————————————————————————
{ chord =  "⇪z",                  app = "opcode", window_default_position = "right" },
--          ⇧z   │ Z    Я    Ζ  │ IINA — add sub-delay -0.5
--          ⌃z   │              │ Unix Terminal — suspend (background)
--          ⌥z   │              │ 📝 — toggle wordwrap
--          ⌘z   │              │  — undo
--———————————————┼——————————————┼——————————————————————————————————
--         ⇪⇧z   │              │
--         ⇪⌃z   │              │
--         ⇪⌥z   │              │
--         ⇪⌘z   │              │
--               │              │ Mail — unsend email
--         ⇧⌃z   │              │
--         ⇧⌥z   │              │
--         ⇧⌘z   │              │  — redo
{ chord = "⌃⌥z",                  app = "n8n" },
{ chord = "⌃⌘z",                  app = "Simulator" },
--         ⌥⌘z   │              │ 📝 — revert selected in git
--———————————————┼——————————————┼——————————————————————————————————
--        ⇪⇧⌃z   │    rewind    │
--        ⇪⇧⌥z   │              │
--        ⇪⇧⌘z   │              │
--        ⇪⌃⌥z   │              │
--        ⇪⌃⌘z   │              │
--        ⇪⌥⌘z   │              │
--        ⇧⌃⌥z   │              │
--        ⇧⌃⌘z   │              │
--        ⇧⌥⌘z   │              │
--        ⌃⌥⌘z   │              │
--               ┴              ┴
}
