tap "buo/cask-upgrade"
tap "candid82/brew"
tap "domt4/autoupdate"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jesseduffield/lazygit"
tap "microsoft/git"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "wix/brew"
tap "yqrashawn/goku"
brew "pango"
brew "librsvg"
brew "python@3.9"
brew "gtk4"
brew "libadwaita"
brew "baobab"
brew "bat"
brew "bundletool"
brew "carthage"
brew "coreutils"
brew "cask"
brew "cocoapods"
brew "diff-so-fancy"
brew "docker"
brew "duti"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "node"
brew "firebase-cli"
brew "fzf"
brew "geoip"
brew "gh"
brew "git"
brew "git-standup"
brew "gitleaks"
brew "htop"
brew "jasper", link: false
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "lynx"
brew "mas"
brew "midnight-commander"
brew "moreutils"
brew "nano"
brew "neofetch"
brew "pre-commit"
brew "rsync"
brew "scrcpy"
brew "swagger-codegen"
brew "tccutil"
brew "tealdeer"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "wget"
brew "wireshark"
brew "yt-dlp"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "jesseduffield/lazygit/lazygit"
brew "qmk/qmk/qmk"
brew "wix/brew/applesimutils"
brew "yqrashawn/goku/goku"
cask "adguard"
cask "airdroid"
cask "aldente"
cask "appcleaner"
cask "appium"
cask "appium-inspector"
cask "binance"
cask "crescendo"
cask "cursor"
cask "devcleaner"
cask "etrecheckpro"
cask "firefox"
cask "flameshot"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "insomnia"
cask "intel-haxm"
cask "iterm2"
cask "itsycal"
cask "jasper"
cask "jetbrains-toolbox"
cask "kdiff3"
cask "maccy"
cask "macs-fan-control"
cask "meld"
cask "mtmr"
cask "notion"
cask "maccy"
cask "objectivesharpie"
cask "obs"
cask "obsidian"
cask "onyx"
cask "postman"
cask "powershell"
cask "sf-symbols"
cask "skype"
cask "steam"
cask "swiftdefaultappsprefpane"
cask "telegram"
cask "terminology"
cask "transmission"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wireshark-chmodbpf"
cask "workflowy"
cask "xee"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Day One", id: 1055511498
mas "Deliveries", id: 290986013
mas "Developer", id: 640199958
mas "DjVu Reader", id: 733144595
mas "feedly", id: 865500966
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "Grammarly for Safari", id: 1462114288
mas "HazeOver", id: 430798174
mas "Microsoft Remote Desktop", id: 1295203466
mas "Peek", id: 1554235898
mas "Pixave", id: 924891282
mas "Reeder", id: 1449412482
mas "RocketSim", id: 1504940162
mas "Shareful", id: 1522267256
mas "Shazam", id: 897118787
mas "Simple Antnotes", id: 846599902
mas "System Designer", id: 1102494854
mas "Telegram Lite", id: 946399090
mas "The Unarchiver", id: 425424353
mas "Transporter", id: 1450874784
vscode "alefragnani.project-manager"
vscode "Angular.ng-template"
vscode "aregghazaryan.glass-ui"
vscode "bbenoist.Nix"
vscode "bbenoist.shell"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "Clancey.comet-debug"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "emilast.LogFileHighlighter"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "idleberg.applescript"
vscode "ivory-lab.jenkinsfile-support"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jdinhlife.gruvbox"
vscode "lehni.vscode-fix-checksums"
vscode "Maarti.jenkins-doc"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "matthew-jin.infersharp-ext"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-maui"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "MS-SarifVSCode.sarif-viewer"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "nabsolutions.nab-al-tools"
vscode "NicolasVuillamy.vscode-groovy-lint"
vscode "nromanov.dotnet-meteor"
vscode "nrwl.angular-console"
vscode "PrateekMahendrakar.resxpress"
vscode "RaidXu.logcat-color"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "virgilsisoe.hammerspoon-snippets"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "WallabyJs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "xaver.clang-format"
vscode "yinfei.luahelper"
vscode "ziyasal.vscode-open-in-github"
