tap "buo/cask-upgrade"
tap "candid82/brew"
tap "domt4/autoupdate"
tap "facebook/fb"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "microsoft/git"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "wix/brew"
tap "yqrashawn/goku"
brew "pango"
brew "librsvg"
brew "node"
brew "appium", link: false
brew "gtk4"
brew "libadwaita"
brew "baobab"
brew "bat"
brew "openjdk"
brew "bundletool"
brew "carthage"
brew "coreutils"
brew "cask"
brew "ruby"
brew "cocoapods"
brew "colima"
brew "detekt"
brew "diff-so-fancy"
brew "docker-completion"
brew "docker"
brew "docker-machine"
brew "duti"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "firebase-cli"
brew "fzf"
brew "geoip"
brew "gh"
brew "git"
brew "git-standup"
brew "gitleaks"
brew "gradle"
brew "htop"
brew "jasper", link: false
brew "imagemagick"
brew "jq"
brew "kdoctor"
brew "kubernetes-cli"
brew "lynx"
brew "mas"
brew "midnight-commander"
brew "moreutils"
brew "nano"
brew "neofetch"
brew "pre-commit"
brew "python@3.9"
brew "rsync"
brew "scrcpy"
brew "swagger-codegen"
brew "tccutil"
brew "tealdeer"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "wget"
brew "wireshark"
brew "yt-dlp"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "jesseduffield/lazygit/lazygit"
brew "qmk/qmk/qmk"
brew "wix/brew/applesimutils"
brew "yqrashawn/goku/goku"
cask "adguard"
cask "airdroid"
cask "aldente"
cask "appcleaner"
cask "appium"
cask "appium-inspector"
cask "arc"
cask "battle-net"
cask "coconutbattery"
cask "crescendo"
cask "cursor"
cask "cyberghost-vpn"
cask "devcleaner"
cask "etrecheckpro"
cask "firefox"
cask "flameshot"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "guitar-pro"
cask "hammerspoon"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "jasper"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "mixxx"
cask "notion"
cask "obs"
cask "onyx"
cask "opera"
cask "postman"
cask "reaper"
cask "sf-symbols"
cask "skype"
cask "steam"
cask "telegram"
cask "terminology"
cask "transmission"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "wireshark-chmodbpf"
cask "workflowy"
cask "yandex"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Day One", id: 1055511498
mas "Developer", id: 640199958
mas "DjVu Reader", id: 733144595
mas "feedly", id: 865500966
mas "Gifski", id: 1351639930
mas "Grammarly for Safari", id: 1462114288
mas "HazeOver", id: 430798174
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Pages", id: 409201541
mas "Peek", id: 1554235898
mas "Pixave", id: 924891282
mas "Reeder", id: 1449412482
mas "RocketSim", id: 1504940162
mas "Shareful", id: 1522267256
mas "Shazam", id: 897118787
mas "Simple Antnotes", id: 846599902
mas "Stage Plot Maker", id: 1506457515
mas "System Designer", id: 1102494854
mas "Telegram Lite", id: 946399090
mas "The Unarchiver", id: 425424353
mas "Transporter", id: 1450874784
vscode "alefragnani.project-manager"
vscode "angular.ng-template"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "idleberg.applescript"
vscode "jdinhlife.gruvbox"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.live-server"
vscode "tomoki1207.pdf"
vscode "virgilsisoe.hammerspoon-snippets"
vscode "vscode-icons-team.vscode-icons"
vscode "wallabyjs.quokka-vscode"
vscode "yinfei.luahelper"
