tap "buo/cask-upgrade"
tap "candid82/brew"
tap "charmbracelet/tap"
tap "domt4/autoupdate"
tap "facebook/fb"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "microsoft/git"
tap "omnisharp/omnisharp-roslyn"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "stevencch99/windsurf-cli"
tap "wix/brew"
tap "xcodesorg/made"
tap "yqrashawn/goku"
brew "icu4c@76"
brew "pango"
brew "librsvg"
brew "aichat"
brew "openblas"
brew "numpy"
brew "aider"
brew "openjdk"
brew "allure"
brew "boost"
brew "gtk4"
brew "libadwaita"
brew "baobab"
brew "bat"
brew "btop"
brew "bundletool"
brew "carthage"
brew "coreutils"
brew "cask"
brew "pkgconf"
brew "hdf5"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "colima"
brew "openjdk@17"
brew "detekt"
brew "diff-so-fancy"
brew "docker-completion"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-machine"
brew "dockutil"
brew "sdl2"
brew "dosbox-x"
brew "duti"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "node"
brew "firebase-cli"
brew "fzf"
brew "gh"
brew "git"
brew "git-standup"
brew "gitleaks"
brew "glances"
brew "gping"
brew "gradle"
brew "htop"
brew "ideviceinstaller"
brew "imagemagick"
brew "imagesnap"
brew "jq"
brew "kdoctor"
brew "kubernetes-cli"
brew "llama.cpp"
brew "llvm"
brew "lynx"
brew "mas"
brew "midnight-commander"
brew "mono"
brew "moreutils"
brew "nano"
brew "neovim"
brew "ollama"
brew "pytorch"
brew "openai-whisper"
brew "opencv"
brew "pipx"
brew "portaudio"
brew "pre-commit"
brew "pyenv"
brew "pygments"
brew "python@3.11"
brew "python-tk@3.11"
brew "python@3.9"
brew "ripgrep"
brew "rsync"
brew "scrcpy"
brew "sevenzip"
brew "swagger-codegen"
brew "tealdeer"
brew "telegram-downloader"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "wget"
brew "widelands"
brew "wireshark"
brew "xcodes"
brew "yazi"
brew "yt-dlp"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "charmbracelet/tap/mods"
brew "heroku/brew/heroku"
brew "jesseduffield/lazygit/lazygit"
brew "omnisharp/omnisharp-roslyn/omnisharp"
brew "qmk/qmk/qmk"
brew "stevencch99/windsurf-cli/windsurf-cli"
brew "wix/brew/applesimutils"
brew "yqrashawn/goku/goku"
cask "0-ad"
cask "adguard"
cask "airdroid"
cask "aldente"
cask "alt-tab"
cask "appcleaner"
cask "appium-inspector"
cask "arc"
cask "ayugram"
cask "battle-net"
cask "blackhole-2ch"
cask "charles"
cask "coconutbattery"
cask "crescendo"
cask "cyberghost-vpn"
cask "dbeaver-community"
cask "devcleaner"
cask "dosbox"
cask "dosbox-x"
cask "endless-sky"
cask "eqmac"
cask "etrecheckpro"
cask "firefox"
cask "flameshot"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "guitar-pro"
cask "hammerspoon"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "lastfm"
cask "limitless"
cask "loom"
cask "maccy"
cask "macs-fan-control"
cask "mixxx"
cask "mos"
cask "notion"
cask "obs"
cask "onyx"
cask "opera"
cask "postman"
cask "raycast"
cask "reaper"
cask "sf-symbols"
cask "skype"
cask "steam"
cask "terminology"
cask "transmission"
cask "ukelele"
cask "utm"
cask "vlc"
cask "vmware-fusion"
cask "wireshark-chmodbpf"
cask "workflowy"
cask "xcodes"
cask "yandex"
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Context Menu", id: 1236813619
mas "Day One", id: 1055511498
mas "Developer", id: 640199958
mas "DjVu Reader", id: 733144595
mas "feedly", id: 865500966
mas "Gifski", id: 1351639930
mas "Grammarly for Safari", id: 1462114288
mas "HazeOver", id: 430798174
mas "Keynote", id: 409183694
mas "LottieFiles", id: 1531085233
mas "MsgFiler", id: 6478043112
mas "Pages", id: 409201541
mas "Peek", id: 1554235898
mas "Pixave", id: 924891282
mas "Raycast Companion", id: 6738274497
mas "Reeder", id: 1449412482
mas "RocketSim", id: 1504940162
mas "Shareful", id: 1522267256
mas "Shazam", id: 897118787
mas "Simple Antnotes", id: 846599902
mas "Stage Plot Maker", id: 1506457515
mas "System Designer", id: 1102494854
mas "Telegram Lite", id: 946399090
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Transporter", id: 1450874784
