tap "candid82/brew"
tap "domt4/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "yqrashawn/goku"
brew "pango"
brew "librsvg"
brew "baobab"
brew "bindfs"
brew "docker", link: false
brew "git-standup"
brew "hardlink-osx"
brew "node"
brew "zsh"
cask "airdroid"
cask "bitbar"
cask "choosy"
cask "firefox"
cask "fork"
cask "github"
cask "gog-galaxy"
cask "hammerspoon"
cask "jetbrains-toolbox"
cask "macs-fan-control"
cask "rescuetime"
cask "scroll-reverser"
cask "skype"
cask "spotify"
cask "steam"
cask "swiftdefaultappsprefpane"
cask "teamviewer"
cask "tor-browser"
cask "transmission"
cask "virtualbox"
cask "vivaldi"
cask "whatsapp"
cask "workflowy"
cask "yt-music"
cask "zoom"
