tap "candid82/brew"
tap "domt4/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "yqrashawn/goku"
brew "python@3.9"
brew "pango"
brew "librsvg"
brew "baobab"
brew "cask"
brew "docker"
brew "geoip"
brew "git-standup"
brew "htop"
brew "mas"
brew "midnight-commander"
brew "node"
brew "tldr"
brew "zsh"
brew "zsh-syntax-highlighting"
cask "airdroid"
cask "bitbar"
cask "choosy"
cask "docker"
cask "firefox"
cask "fork"
cask "github"
cask "gog-galaxy"
cask "hammerspoon"
cask "jetbrains-toolbox"
cask "macs-fan-control"
cask "mailmate"
cask "protonvpn"
cask "rescuetime"
cask "scroll-reverser"
cask "skype"
cask "spotify"
cask "steam"
cask "swiftdefaultappsprefpane"
cask "teamviewer"
cask "tor-browser"
cask "transmission"
cask "virtualbox"
cask "vivaldi"
cask "whatsapp"
cask "workflowy"
cask "yt-music"
cask "zoom"
mas "Boop", id: 1518425043
mas "Elmedia Video Player", id: 1044549675
mas "Keyboard Pilot", id: 402670023
mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
