tap "buo/cask-upgrade"
tap "candid82/brew"
tap "charmbracelet/tap"
tap "domt4/autoupdate"
tap "facebook/fb"
tap "kegworks-app/kegworks"
tap "microsoft/git"
tap "n8n-io/n8n"
tap "ngrok/ngrok"
tap "omnisharp/omnisharp-roslyn"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "stevencch99/windsurf-cli"
tap "wix/brew"
brew "pango"
brew "librsvg"
brew "aichat"
brew "openblas"
brew "python@3.12"
brew "aider"
brew "openjdk"
brew "allure"
brew "gtk4"
brew "libadwaita"
brew "baobab"
brew "bat"
brew "blueutil"
brew "boost"
brew "btop"
brew "bundletool"
brew "carthage"
brew "coreutils"
brew "cask"
brew "pkgconf"
brew "hdf5"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "colima"
brew "cowsay"
brew "ddgr"
brew "detekt"
brew "diff-so-fancy"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-machine"
brew "dockutil"
brew "portaudio"
brew "sdl2"
brew "dosbox-x"
brew "duti"
brew "exiftool"
brew "eye-d3"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "findutils"
brew "firebase-cli"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-standup"
brew "gitleaks"
brew "glances"
brew "goku"
brew "gping"
brew "gradle"
brew "terminal-notifier"
brew "heroku"
brew "id3v2"
brew "ideviceinstaller"
brew "imagemagick"
brew "imagesnap"
brew "joker"
brew "jq"
brew "kdoctor"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "links"
brew "llama.cpp"
brew "llvm"
brew "lynx"
brew "m-cli"
brew "mas"
brew "midnight-commander"
brew "mods"
brew "mono"
brew "moreutils"
brew "nano"
brew "neovim"
brew "node@22"
brew "noti"
brew "numpy"
brew "ollama"
brew "pytorch"
brew "openai-whisper"
brew "opencv"
brew "openjdk@17"
brew "php"
brew "pipx"
brew "pre-commit"
brew "pstree"
brew "pyenv"
brew "pygments"
brew "python@3.10"
brew "python-tk@3.10"
brew "python@3.11"
brew "python-tk@3.11"
brew "python@3.9"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "scrcpy"
brew "sdl12-compat"
brew "sevenzip"
brew "swagger-codegen"
brew "tealdeer"
brew "telegram-downloader"
brew "tiny"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "widelands"
brew "yarn"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "wix/brew/applesimutils"
cask "adguard"
cask "aionui"
cask "aldente"
cask "appcleaner"
cask "ayugram"
cask "claude"
cask "coconutbattery"
cask "crescendo"
cask "dbeaver-community"
cask "dosbox"
cask "etrecheckpro"
cask "focusrite-control"
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "google-chrome"
cask "google-drive"
cask "guitar-pro"
cask "hammerspoon"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "macs-fan-control"
cask "mixxx"
cask "ngrok"
cask "obsidian"
cask "onyx"
cask "postman"
cask "raycast"
cask "sf-symbols"
cask "shottr"
cask "sloth"
cask "terminology"
cask "transmission"
cask "utm"
cask "visual-studio-code"
cask "workflowy"
cask "yandex"
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "ContextMenu", id: 1236813619
mas "Day One", id: 1055511498
mas "Developer", id: 640199958
mas "DjVu Reader", id: 733144595
mas "feedly", id: 865500966
mas "Folder Preview", id: 6698876601
mas "Gifski", id: 1351639930
mas "GIPHY CAPTURE", id: 668208984
mas "Grammarly for Safari", id: 1462114288
mas "Keynote", id: 409183694
mas "LottieFilesApp", id: 1531085233
mas "MsgFiler 4", id: 6478043112
mas "NepTunes", id: 1006739057
mas "Pages", id: 409201541
mas "Peek", id: 1554235898
mas "Pixave", id: 924891282
mas "Raycast Companion", id: 6738274497
mas "Reeder", id: 1449412482
mas "RocketSim", id: 1504940162
mas "Shareful", id: 1522267256
mas "Shazam", id: 897118787
mas "Simple Antnotes", id: 846599902
mas "StagePlotMaker", id: 1506457515
mas "System Designer", id: 1102494854
mas "Telegram Lite", id: 946399090
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Transporter", id: 1450874784
mas "Windows App", id: 1295203466
vscode "alefragnani.project-manager"
vscode "angular.ng-template"
vscode "aregghazaryan.glass-ui"
vscode "bbenoist.nix"
vscode "bbenoist.shell"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clancey.comet-debug"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "idleberg.applescript"
vscode "ivory-lab.jenkinsfile-support"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jdinhlife.gruvbox"
vscode "lehni.vscode-fix-checksums"
vscode "maarti.jenkins-doc"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "matthew-jin.infersharp-ext"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-maui"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-sarifvscode.sarif-viewer"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "nabsolutions.nab-al-tools"
vscode "nguyenngoclong.terminal-keeper"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "nromanov.dotnet-meteor"
vscode "nrwl.angular-console"
vscode "prateekmahendrakar.resxpress"
vscode "raidxu.logcat-color"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "virgilsisoe.hammerspoon-snippets"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "wallabyjs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "xaver.clang-format"
vscode "yinfei.luahelper"
vscode "ziyasal.vscode-open-in-github"
