tap "candid82/brew"
tap "domt4/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "yqrashawn/goku"
brew "python@3.9"
brew "pango"
brew "librsvg"
brew "baobab"
brew "cask"
brew "docker"
brew "geoip"
brew "git"
brew "git-standup"
brew "htop"
brew "mas"
brew "midnight-commander"
brew "node"
brew "tldr"
brew "zsh"
brew "zsh-syntax-highlighting"
cask "airdroid"
cask "bitbar"
cask "choosy"
cask "docker"
cask "dotnet-sdk"
cask "firefox"
cask "fork"
cask "github"
cask "gog-galaxy"
cask "hammerspoon"
cask "jetbrains-toolbox"
cask "macs-fan-control"
cask "mailmate"
cask "mono-mdk-for-visual-studio"
cask "protonvpn"
cask "rescuetime"
cask "scroll-reverser"
cask "skype"
cask "spotify"
cask "steam"
cask "swiftdefaultappsprefpane"
cask "teamviewer"
cask "tor-browser"
cask "transmission"
cask "virtualbox"
cask "visual-studio"
cask "vivaldi"
cask "vlc"
cask "whatsapp"
cask "workflowy"
cask "yt-music"
cask "zoom"
mas "AdBlock", id: 1402042596
mas "Amphetamine", id: 937984704
mas "Apple Configurator 2", id: 1037126344
mas "Be Focused", id: 973134470
mas "Bear", id: 1091189122
mas "Day One", id: 1055511498
mas "Developer", id: 640199958
mas "feedly", id: 865500966
mas "Fotor Photo Editor", id: 503039729
mas "GarageBand", id: 682658836
mas "Ghostery Lite", id: 1436953057
mas "Grammarly for Safari", id: 1462114288
mas "HiSuite", id: 1232508288
mas "Keyboard Pilot", id: 402670023
mas "Kindle", id: 405399194
mas "Microsoft Remote Desktop", id: 1295203466
mas "Pages", id: 409201541
mas "Reeder", id: 1449412482
mas "Shazam", id: 897118787
mas "Simple Antnotes", id: 846599902
mas "Tayasui Sketches", id: 1178074963
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
mas "XMind", id: 1327661892
